-*- coding: utf-8-emacs -*-
#+title: Learn You A Haskell In Two Weeks
#+haskell_load_module: "SessionManager"
**** ex
#+BEGIN_SRC haskell
:! ls
#+END_SRC

#+RESULTS:
: app	 dist-newstyle	flake.nix  learnyouahaskell.cabal      learn-you-haskell_bak  result
: baby.hs  flake.lock	hie.yaml   learnyouahaskell.github.io  Main.hs		      src

#+BEGIN_SRC haskell
:cd ..
#+END_SRC

#+BEGIN_SRC haskell
:l baby
#+END_SRC

#+BEGIN_SRC haskell
:l /path-to-Main/Main.hs
#+END_SRC

#+BEGIN_SRC haskell
tripleTest 4
#+END_SRC

#+BEGIN_SRC haskell :results output
:r
#+END_SRC

#+RESULTS:
: [1 of 1] Compiling Main             ( Main.hs, interpreted )
: Ok, one module loaded.

#+BEGIN_SRC haskell :results output
main
#+END_SRC

#+RESULTS:
: Hello, Haedosa!

**** ex
#+BEGIN_SRC haskell
:{
-- lucky :: (Integral a) => a -> String
lucky 7 = "LUCKY NUMBER SEVEN!"
lucky x = "Sorry, you're out of luck, pal!"
:}
lucky 4
#+END_SRC

#+RESULTS:
: Sorry, you're out of luck, pal!

#+BEGIN_SRC haskell
lucky 8
#+END_SRC

#+RESULTS:
: Sorry, you're out of luck, pal!

#+BEGIN_SRC haskell
:{
-- sayMe :: (Integral a) => a -> String
sayMe 1 = "One!"
sayMe 2 = "Two!"
sayMe 3 = "Three!"
sayMe 4 = "Four!"
sayMe 5 = "Five!"
sayMe x = "Not between 1 and 5"
:}
sayMe 'a'
#+END_SRC

#+RESULTS:
: <interactive>:140:1: error:
:     • No instance for (Num Char) arising from a use of ‘sayMe’
:     • In the expression: sayMe 'a'
:       In an equation for ‘it’: it = sayMe 'a'

#+BEGIN_SRC haskell
:{
-- factorial :: (Integral a) => a -> a
factorial 0 = 1
factorial n = n * factorial (n - 1)
:}
factorial 10
#+END_SRC

#+RESULTS:
: 3628800

#+BEGIN_SRC haskell
:{
-- charName :: Char -> String
charName 'a' = "Albert"
charName 'b' = "Broseph"
charName 'c' = "Cecil"
:}
charName 'h'
#+END_SRC

#+RESULTS:
: "*** Exception: <interactive>:(114,1)-(116,22): Non-exhaustive patterns in function charName

#+BEGIN_SRC haskell
:{
-- addVectors :: (Num a) => (a, a) -> (a, a) -> (a, a)
addVectors a b = (fst a + fst b, snd a + snd b)
:}
#+END_SRC

#+BEGIN_SRC haskell
:{
-- addVectors :: (Num a) => (a, a) -> (a, a) -> (a, a)
addVectors (x1, y1) (x2, y2) = (x1 + x2, y1 + y2)
:}
addVectors (1,2) (3,6)
#+END_SRC

#+RESULTS:
| 4 | 8 |

#+BEGIN_SRC haskell
:{
--first :: (a, b, c) -> a
first (x, _, _) = x

--second :: (a, b, c) -> b
second (_, y, _) = y

--third :: (a, b, c) -> c
third (_, _, z) = z
:}
second (1,2,3)
#+END_SRC

#+RESULTS:
: 2

#+BEGIN_SRC haskell
:{
xs = [(1,3), (4,3), (2,4), (5,3), (5,6), (3,1)]
:}
:{
[a+b | (a,b) <- xs]
:}
#+END_SRC

#TODO: xs의 짝수개 뽑으면서 위에거 해보기

#+BEGIN_SRC haskell
:{
-- capital :: String -> String
capitalsaa "" = "Empty string, whoops!"
capitalsaa a@(x:y:xs) = "The first letter of " ++ a ++ " is " ++ [x] ++ " a " ++ xs
:}
capitalsaa "Dracula"
#+END_SRC

#+RESULTS:
: The first letter of Dracula is D and acula

